Тестовая_база_ERP_14/src/InformationRegisters/УчетнаяПолитикаПоНДФЛРасширенный/УчетнаяПолитикаПоНДФЛРасширенный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаПоНДФЛРасширенный</name>
  <resources>
    <name>УдержаниеНДФЛПриВыплатеМежрасчетныхНачисленийСАвансом</name>
    <type>
      <types>EnumRef.УдержаниеНДФЛПриВыплатеМежрасчетныхНачисленийСАвансом</types>
    </type>
  </resources>
  <resources>
    <name>ВыбиратьВДокументеНеобходимостьУдержанияНДФЛПриВыплатеСАвансом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/УдержаниеНДФЛПриВыплатеМежрасчетныхНачисленийСАвансом/УдержаниеНДФЛПриВыплатеМежрасчетныхНачисленийСАвансом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УдержаниеНДФЛПриВыплатеМежрасчетныхНачисленийСАвансом</name>
  <enumValues>
    <name>УдерживатьНалог</name>
  </enumValues>
  <enumValues>
    <name>НеУдерживатьНалог</name>
  </enumValues>
  <enumValues>
    <name>УказыватьВДокументеНеобходимостьУдержанияНалогаПриВыплатеСАвансом</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/InformationRegisters/УчетнаяПолитикаПоНДФЛРасширенный/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	СтруктураЗаписи = Новый Структура("Организация");
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Запись);
				
		Если ЗначениеЗаполнено(Запись.Организация) И ЗарплатаКадры.ГоловнаяОрганизация(Запись.Организация) <> Запись.Организация Тогда
			Отказ = Истина;
			ТекстОшибки = НСтр("ru = 'Учетная политика по НДФЛ определяется только для головных организаций.';
								|en = 'Accounting policy for PIT is determined only for parent companies.'");
			КлючЗаписи = РегистрыСведений.ДокументыФизическихЛиц.СоздатьКлючЗаписи(СтруктураЗаписи);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, КлючЗаписи, "Запись.Организация");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.ВыбиратьВДокументеНеобходимостьУдержанияНДФЛПриВыплатеСАвансом = Запись.УдержаниеНДФЛПриВыплатеМежрасчетныхНачисленийСАвансом = Перечисления.УдержаниеНДФЛПриВыплатеМежрасчетныхНачисленийСАвансом.УказыватьВДокументеНеобходимостьУдержанияНалогаПриВыплатеСАвансом;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организации", ОбщегоНазначения.ВыгрузитьКолонку(ЭтотОбъект, "Организация"));
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Организации.Ссылка КАК Организация,
	               |	УчетнаяПолитикаПоНДФЛРасширенный.*
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаПоНДФЛРасширенный КАК УчетнаяПолитикаПоНДФЛРасширенный
	               |		ПО Организации.ГоловнаяОрганизация = УчетнаяПолитикаПоНДФЛРасширенный.Организация
	               |			И (Организации.ГоловнаяОрганизация В (&Организации))
	               |			И (Организации.Ссылка <> Организации.ГоловнаяОрганизация)
	               |			И (НЕ Организации.ПометкаУдаления)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоНДФЛРасширенный.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
